{
    "id": "53849",
    "title": "Pixelia",
    "description": "Pass levels with your character in the world of Pixelia, defeat 3 different seasons and mushroom forests.Dont die while doing these, collect all the gold and take them back.",
    "instructions": "Arrow keys for move Double jump active ",
    "url": "https://html5.gamemonetize.com/bvd21w5gkhx7cgo4pjslym1nb4e7lyjb/",
    "category": "Arcade",
    "tags": "1 Player, 2D, Action, Adventure, Animal, Arcade, free games for your site, free games for your website, free html5 games for your website, World",
    "thumb": "https://img.gamemonetize.com/bvd21w5gkhx7cgo4pjslym1nb4e7lyjb/512x384.jpg",
    "width": "400",
    "height": "240"
  },
  {
    "id": "53818",
    "title": "Wild Hunting Clash",
    "description": "Challenge yourself and hunt beautiful animals in stunningly luscious woods. The calming sounds of the forest and lovely graphics will capture your heart. Feel like a true hunter in the unconquered wilderness!",
    "instructions": "Shoot the animals and collect their trophies in all the different levels to progress to the next region Unlock and upgrade your hunting gear using the gold you get as a reward ",
    "url": "https://html5.gamemonetize.com/wd7cq3e3clalkrf48pize43ad29glody/",
    "category": "Arcade",
    "tags": "3D, 3D Games, Animal, Hunting, Shoot, Shooting",
    "thumb": "https://img.gamemonetize.com/wd7cq3e3clalkrf48pize43ad29glody/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53891",
    "title": "Cute Princess Dress Up",
    "description": "Cute Princess Dress Up is a casual girl game. In this game, you need to do SPA, Hair Salon,Battle, Makeup for the beautiful princess. Doing SPA will make the princess have white skin, doing hair style will increase the princesss charm, and make up will make the princess whole temperament rise. As the princesss stylist, you have to help the princess match a beautifuloutfit. Let her win the PK. The game provides various makeup props and various styles of clothes.Come and give it a try!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/plen5fnjkx1v4xt4vlbwq6m0z4zr1ptt/",
    "category": "Puzzle",
    "tags": "Dress Up, Girls",
    "thumb": "https://img.gamemonetize.com/plen5fnjkx1v4xt4vlbwq6m0z4zr1ptt/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "53869",
    "title": "World of Alice   Animals Puzzle",
    "description": "World of Alice - Animal Puzzle World of Alice - Animal Puzzle is an educational game developed for children where you will complete puzzles with images of various animals in a fun way from your cell phone, tablet or computer. Excellent educational resource. In World of Alice, learning is fun.",
    "instructions": "Complete the Puzzle ",
    "url": "https://html5.gamemonetize.com/x6od5q5lupuom74paxg1cvgchssh86de/",
    "category": "Puzzle",
    "tags": "Animal, Best Games, Cartoon, Educational, free games for your site, free games for your website, free html5 games for your website, html games for your website, html5 games, html5 games for your site, Kids, Logic, Logical, School",
    "thumb": "https://img.gamemonetize.com/x6od5q5lupuom74paxg1cvgchssh86de/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "53846",
    "title": "Cable Untangler",
    "description": "Zombie Cowboy Shooter is a thrilling action game where players step into the boots of a lone cowboy in a post-apocalyptic world overrun by the undead. Armed with a trusty revolver and a keen aim, they must navigate through desolate landscapes, facing hordes of zombies at every turn. With fast-paced gameplay, strategic gunplay, and intense survival challenges, players must outwit and outgun their undead foes to reclaim the Wild West from the clutches of the zombie apocalypse. Website Developer \u003Ca href='https://www.coolcrazygames.com/'\u003Ehttps://www.coolcrazygames.com/\u003C/a\u003E",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/46x9agu10xrx9nubb83cajq0923xojve/",
    "category": "Arcade",
    "tags": "Action, Android, Arcade, HTML5, iPad, iPhone, Mobile",
    "thumb": "https://img.gamemonetize.com/46x9agu10xrx9nubb83cajq0923xojve/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53874",
    "title": "Number Shoot",
    "description": "&ldquo;Number Shoot&rdquo; is an addictive relaxing bubble game. Come to play Number Bubble Shooter and give your brain a rest!Come and play this game and become a master of number bubble game now!",
    "instructions": " Tap the screen to shoot the number bubble The same numbers will be merged to a larger number ",
    "url": "https://html5.gamemonetize.com/6ew9vt8manzs2v007v5uy7fkn6fw5vtt/",
    "category": "Hypercasual",
    "tags": "2048, Bubble Shooter, Number",
    "thumb": "https://img.gamemonetize.com/6ew9vt8manzs2v007v5uy7fkn6fw5vtt/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53883",
    "title": "Shakira Funny Face",
    "description": "Shakira Funny Face where with just a few clicks of your mouse, youll be able to drag and manipulate yellow dots to transform Shakiras expression into a laugh-out-loud masterpiece. From silly grins to exaggerated pouts, the possibilities are endless as you experiment with different combinations to achieve the perfect funny face.",
    "instructions": "Mouse or tap to play ",
    "url": "https://html5.gamemonetize.com/fovk69i9mxojavba9ndibaztsyfucnai/",
    "category": "Girls",
    "tags": "Arcade, Casual, Celebrity, Fun, Funny, HTML5, Hypercasual, Kids",
    "thumb": "https://img.gamemonetize.com/fovk69i9mxojavba9ndibaztsyfucnai/512x384.jpg",
    "width": "640",
    "height": "480"
  },
  {
    "id": "53813",
    "title": "Celebrity Core Fashion Battle",
    "description": "Welcome to Celebrity Core Fashion Battle. These celebrities want to try a core fashion. Each one of them wants to try a different core style. Help them to select a unique style for each one of them by choosing a fashion card. Then browse the wardrobe and pick cute outfits which shoe their fashion style.",
    "instructions": "Left Mouse Button Click",
    "url": "https://html5.gamemonetize.com/c2vo5wesu7beyit9wz5hfez6feevar4p/",
    "category": "Girls",
    "tags": "Celebrity, Cute, Dress Up, Fashion, Girls",
    "thumb": "https://img.gamemonetize.com/c2vo5wesu7beyit9wz5hfez6feevar4p/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53783",
    "title": "World of Alice   Sports Cards",
    "description": "World of Alice - Sports Cards World of Alice - Sports Cards is an educational game developed for children where they can play with a card puzzle on objects related to sports in a fun way using their cell phone, tablet or computer. Excellent educational resource. In World of Alice, learning is fun.",
    "instructions": "Drag the object to complete the cards ",
    "url": "https://html5.gamemonetize.com/yypn8891tgwqa4659na7tgo4gjyg232w/",
    "category": "Puzzle",
    "tags": "Best Games, Card, Cartoon, Educational, free games for your site, free games for your website, free html5 games for your website, HTML, html games for your website, HTML5, Kids, School, Sport, Sports",
    "thumb": "https://img.gamemonetize.com/yypn8891tgwqa4659na7tgo4gjyg232w/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "52889",
    "title": "Dots n Lines",
    "description": "A quick, engaging game that can be enjoyed by people of all ages. Its simple rules and strategic depth make it a timeless classic. Key Features: Classic Gameplay Complete with Smart AI components Challenge players from around the globe Family-Friendly Endless Fun",
    "instructions": "Mouse click or tap to play Click between Dot to play ",
    "url": "https://html5.gamemonetize.com/mkr3mb80caqtrt3shwaatxn486fyoieg/",
    "category": "Puzzle",
    "tags": "1 Player, 2 Player Games, puzzleblock",
    "thumb": "https://img.gamemonetize.com/mkr3mb80caqtrt3shwaatxn486fyoieg/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "53647",
    "title": "Unblocking Wrench Puzzle",
    "description": "Step into an electrifying adventure of mechanical expertise in our distinctively captivating game. Through precise taps, orchestrate a ballet of rotating wrenches directing screws along a communal surface. Yet, beware of collisions that may impede your progress! Employ strategic prowess to untangle this intricate puzzle, ensuring screws pirouette in perfect harmony. With multiple wrenches managing myriad screws, every level requires adept coordination and strategic planning. Website Developer \u003Ca href='https://www.insanegamesonline.com/'\u003Ehttps://www.insanegamesonline.com/\u003C/a\u003E",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/exgtwqf3jzqjaeur2y8c5wmsipv13d4d/",
    "category": "Hypercasual",
    "tags": "Android, HTML5, Mentolatux, Mobile, Puzzle, Skill",
    "thumb": "https://img.gamemonetize.com/exgtwqf3jzqjaeur2y8c5wmsipv13d4d/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53854",
    "title": "Bananas clicker",
    "description": "Bananas Clicker is an addictive idle clicking game that transports players to a vibrant jungle filled with lush greenery and dangling clusters of ripe bananas. In this tropical paradise, players embark on a thrilling quest to become the ultimate banana tycoon.",
    "instructions": "Click to Bananas to start",
    "url": "https://html5.gamemonetize.com/jhuhd9lxirm5t1vw5wi4czyv0swfkf8k/",
    "category": "Hypercasual",
    "tags": "1 Player, 2D, amazing, Arcade, Baby, Baby Games, Best, Best Games, Click, Clicker, Cool, Fruit, Fun, Funny",
    "thumb": "https://img.gamemonetize.com/jhuhd9lxirm5t1vw5wi4czyv0swfkf8k/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53817",
    "title": "Celebrity First Date Adventure",
    "description": "Welcome to Celebrity First Date Adventure. Our favorite Celebrity couple planned for an adventure date. Both are excited and want to be more attractive. They need some expert advice. Browse their wardrobe and pick a cute outfit for them. Help the couple and make their date the most memorable one!",
    "instructions": "Left Mouse Button Click",
    "url": "https://html5.gamemonetize.com/0ejkv63pisrqny0qm0pllcnv581qr93n/",
    "category": "Girls",
    "tags": "Cute, Dress Up, Fashion, Girls",
    "thumb": "https://img.gamemonetize.com/0ejkv63pisrqny0qm0pllcnv581qr93n/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53772",
    "title": "Maze Madness Adventure",
    "description": "Embark on an epic journey with Maze Madness Adventure, a maze-solving extravaganza! Navigate through a multitude of challenging levels, each designed to test your skills and intellect. Choose your preferred mode conquer mazes at your pace in normal mode, race against time in the adrenaline-pumping timed mode, or navigate through the shadows in the intense darkness mode.",
    "instructions": "Find a way ",
    "url": "https://html5.gamemonetize.com/3g6yqjh8ie1q8sha9o26qghoz3q1391s/",
    "category": "Puzzle",
    "tags": "1 Player, 2D, Best Games, Brain",
    "thumb": "https://img.gamemonetize.com/3g6yqjh8ie1q8sha9o26qghoz3q1391s/512x384.jpg",
    "width": "1280",
    "height": "1024"
  },
  {
    "id": "53617",
    "title": "Worm Arcade 2d",
    "description": "Dive into the thrilling world of Worm Arcade 2D, where you control a nimble worm navigating treacherous obstacles. With precision timing and quick reflexes, guide your worm through challenging levels filled with spikes, pits, and other hazards. Can you conquer every obstacle and emerge victorious?",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/hzxwelopp021wcpy9fk6tpgrqnkvvkhl/",
    "category": "Hypercasual",
    "tags": "2D, Android, HTML5, jump, Mentolatux, Mobile, unity, Worm, Worms",
    "thumb": "https://img.gamemonetize.com/hzxwelopp021wcpy9fk6tpgrqnkvvkhl/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53749",
    "title": "Battle Of Heros",
    "description": "Dive into a strategic world where your prowess as a commander determines the fate of your empire. In this Tower Defense Strategy game, marshal your resources to summon units and engage in relentless combat. Earn coins by defeating foes to enhance your bases defenses and unlock mighty warriors. With a strategic limit on active units and special unit restrictions, every decision counts. Both bases possess an auto-heal ability, ensuring the battle endures until one falls. Lead your heroes to victory and claim your place in history!",
    "instructions": "- Click on any unlocked unit to deploy it ",
    "url": "https://html5.gamemonetize.com/g2r3vgbd8vyrc2h07pnyq5z1544cez3f/",
    "category": "Adventure",
    "tags": "1 Player, Action, Battle, Casual, Strategy, Tower Defense, War",
    "thumb": "https://img.gamemonetize.com/g2r3vgbd8vyrc2h07pnyq5z1544cez3f/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "53676",
    "title": "Footbag Fanatic",
    "description": "Experience the excitement of this fantastic casual arcade football game! To kick the bag, your adorable tiny character must be airborne! Watch the score multiplier soar until the bag hits a wall. Unlock a plethora of new tiny characters and balls to enhance your gaming experience. Can you unlock all the characters and balls? Test your skills and find out!",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/cifu259dqy893zivlmf4ytvmumfuscq8/",
    "category": "Hypercasual",
    "tags": "Casual, Football, HTML5, Ninja, Pixel, Santa, Soccer, Sport, Sports",
    "thumb": "https://img.gamemonetize.com/cifu259dqy893zivlmf4ytvmumfuscq8/512x384.jpg",
    "width": "568",
    "height": "320"
  },
  {
    "id": "53844",
    "title": "Vampire Survivors Dark",
    "description": "Vampire Survivors Dark is an online action game where you choose your beloved hero among four characters and defeat the darkness minions you encounter. You will fight with them on the battlefield. Eliminate them with strategic movements, and get the diamonds dropped to the ground to fulfill the level bar at the top. Resist these predatory creatures as long as you can in this RPG game. Website Developer \u003Ca href='https://www.onlinegames.io/'\u003Ehttps://www.onlinegames.io/\u003C/a\u003E",
    "instructions": "WASD Arrow Keys or Mouse Move Touchscreen for Mobile Devices",
    "url": "https://html5.gamemonetize.com/5oizge6uwba44e1em9m9tsok5k7knoxg/",
    "category": "Boys",
    "tags": "survival",
    "thumb": "https://img.gamemonetize.com/5oizge6uwba44e1em9m9tsok5k7knoxg/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "53789",
    "title": "Funny Snake 2",
    "description": "Funny Snake 2 is a game in which you need to control the snake in order to collect apples, avoid fire obstacles and break the big ice with fire to free the key and open the door and go further.",
    "instructions": "Use your mouse or tap on the screen or use the left and right arrow keys on your keyboard ",
    "url": "https://html5.gamemonetize.com/pixhl7sswqcurn7f0bucyt86tsjqtun0/",
    "category": "Arcade",
    "tags": "Avoid, Best, Best Games, Collecting, Fun, Kids, Obstacle, Snake",
    "thumb": "https://img.gamemonetize.com/pixhl7sswqcurn7f0bucyt86tsjqtun0/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "53748",
    "title": "Little Panda Candy Shop",
    "description": "Little Panda Candy Shop is a very cute Cooking game. This game will satisfy all your curiosity about candies. It introduces you to how candies are made and wrapped. At the beginning of the game, you need to make the original syrup first by putting ingredients like butter, sugar, eggs,and lemon in a boiler and simmering them. Then you will select 1-6 of the 12 ingredients to juice as a flavoring for the syrup. If you are interested, come and enjoy it.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/amokhnvzrbcx9i60tth781mih58ncume/",
    "category": "Puzzle",
    "tags": "1 Player, Candy, Girls, Panda, Puzzle",
    "thumb": "https://img.gamemonetize.com/amokhnvzrbcx9i60tth781mih58ncume/512x384.jpg",
    "width": "1920",
    "height": "1080"
  }
